In [1]:
import pandas as pd
data = {'age': [25, 22, 18, 30, 45, 50, 35, 20, 55, 40],
        'gender': ['M', 'F', 'F', 'M', 'M', 'F', 'M', 'F', 'M', 'M'],
        'score': [90, 80, 75, 95, 70, 85, 75, 90, 95, 85]}
df = pd.DataFrame(data)

In [2]:
df.head()

   age gender  score
0   25      M     90
1   22      F     80
2   18      F     75
3   30      M     95
4   45      M     70

In [5]:
df['gender'].value_counts()

M    6
F    4
Name: gender, dtype: int64

In [6]:
# get age over 30
df[df.where(df['age']>30,other=0).all(1)]

   age gender  score
4   45      M     70
5   50      F     85
6   35      M     75
8   55      M     95
9   40      M     85

In [8]:
# find males over 30
f1 = df['age']>30
f2 = df['gender']=="M"

df[df.where(f1 & f2,other=0).all(1)]

   age gender  score
4   45      M     70
6   35      M     75
8   55      M     95
9   40      M     85